<a href="https://colab.research.google.com/github/LuisFTacla/WDW_Attendance_Calculator/blob/main/Plots_diarios.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
# IMPORTANDO BIBLIOTECAS
import pandas as pd
import seaborn as sns
import numpy as np
import scipy.interpolate as interpolate
import matplotlib.pyplot as plt
from datetime import datetime
from datetime import timedelta

# LENDO URI
uri_0 = 'https://raw.githubusercontent.com/LuisFTacla/WDW_Attendance_Calculator/main/Datasets/Parks/MagicKingdom.csv'
uri_1 = 'https://raw.githubusercontent.com/LuisFTacla/WDW_Attendance_Calculator/main/Datasets/Parks/Epcot.csv'
uri_2 = 'https://raw.githubusercontent.com/LuisFTacla/WDW_Attendance_Calculator/main/Datasets/Parks/HollywoodStudios.csv'
uri_3 = 'https://raw.githubusercontent.com/LuisFTacla/WDW_Attendance_Calculator/main/Datasets/Parks/AnimalKingdom.csv'

# LENDO ARQUIVOS
MagicKingdom = pd.read_csv(uri_0)
Epcot = pd.read_csv(uri_1)
HollywoodStudios = pd.read_csv(uri_2)
AnimalKingdom = pd.read_csv(uri_3)

MagicKingdom.drop(columns = ['Unnamed: 0'], inplace = True)
Epcot.drop(columns = ['Unnamed: 0'], inplace = True)
HollywoodStudios.drop(columns = ['Unnamed: 0'], inplace = True)
AnimalKingdom.drop(columns = ['Unnamed: 0'], inplace = True)

# ARRAY COM OS PARQUES
Parks = [MagicKingdom, Epcot, HollywoodStudios, AnimalKingdom]

In [ ]:
y = 2016
m = 10
d = 26
fig = plt.figure(figsize = (15,8))
eixo = fig.add_axes([0, 0, 1, 1])
eixo.plot(MagicKingdom['data_e_hora'], MagicKingdom['Splash Mountain'], color = 'blue')
eixo.plot(MagicKingdom['data_e_hora'], MagicKingdom['Pirates of Caribbean'], color = 'green')
eixo.plot(MagicKingdom['data_e_hora'], MagicKingdom['Seven Dwarfs Mine Train'], color = 'red')

data_escolhida = datetime(y, m, d)
dia_seguinte = data_escolhida + timedelta(days=1)
eixo.set_xlim(data_escolhida, dia_seguinte)
eixo.set_title('{} - {}/{}/{}'.format('Magic Kingdom' , d, m, y), fontsize = 25)
eixo.set_ylabel('Tempo de fila (minutos)', fontsize = 20)
eixo.set_xlabel('Horário', fontsize = 20)
eixo.legend(['Splash Mountain', 'Pirates of Caribbean', 'Seven Dwarfs Mine Train'], loc = 'upper right', fontsize = 15)

In [ ]:
def plot_magic_kingdom(d, m, y):
  fig = plt.figure(figsize = (15,8))
  eixo = fig.add_axes([0, 0, 1, 1])
  eixo.plot(Parks[0]['data_e_hora'], Parks[0]['Splash Mountain'], color = 'blue')
  eixo.plot(Parks[0]['data_e_hora'], Parks[0]['Pirates of Caribbean'], color = 'green')
  eixo.plot(Parks[0]['data_e_hora'], Parks[0]['Seven Dwarfs Mine Train'], color = 'red')

  data_escolhida = datetime(y, m, d)
  dia_seguinte = data_escolhida + timedelta(days=1)
  eixo.set_xlim(data_escolhida, dia_seguinte)
  eixo.set_title('{} - {}/{}/{}'.format('Magic Kingdom' , d, m, y), fontsize = 25)
  eixo.set_ylabel('Tempo de fila (minutos)', fontsize = 20)
  eixo.set_xlabel('Horário', fontsize = 20)
  eixo.legend(['Splash Mountain', 'Pirates of Caribbean', 'Seven Dwarfs Mine Train'], loc = 'upper right', fontsize = 15)

def plot_epcot(date):
  fig = plt.figure(figsize = (15,8))
  eixo = fig.add_axes([0, 0, 1, 1])


def plot_hollywood_studios(date):
  fig = plt.figure(figsize = (15,8))
  eixo = fig.add_axes([0, 0, 1, 1])


def plot_animal_kingdom(date):
  fig = plt.figure(figsize = (15,8))
  eixo = fig.add_axes([0, 0, 1, 1])





days = int(input('Quandos dias gostaria de analisar?'))
for days in range(0, days):
  print('Escolha uma data entre 01/01/2015 e 31/12/2019: ')
  d = int(input('Dia: '))
  m = int(input('Mês: '))
  y = int(input('Ano: '))

  plot_magic_kingdom(d, m, y)

                data_e_hora  Soarin  Spaceship Earth
0       2015-01-01 00:00:00     0.0              0.0
1       2015-01-01 00:05:00     0.0              0.0
2       2015-01-01 00:10:00     0.0              0.0
3       2015-01-01 00:15:00     0.0              0.0
4       2015-01-01 00:20:00     0.0              0.0
...                     ...     ...              ...
525883  2019-12-31 23:35:00    35.0             25.0
525884  2019-12-31 23:40:00    35.0             25.0
525885  2019-12-31 23:45:00    35.0             25.0
525886  2019-12-31 23:50:00    35.0             25.0
525887  2019-12-31 23:55:00    35.0             25.0

[525888 rows x 3 columns]

In [ ]:
Parks[2]

                data_e_hora  ...  Toy Story Mania
0       2015-01-01 00:00:00  ...              0.0
1       2015-01-01 00:05:00  ...              0.0
2       2015-01-01 00:10:00  ...              0.0
3       2015-01-01 00:15:00  ...              0.0
4       2015-01-01 00:20:00  ...              0.0
...                     ...  ...              ...
525883  2019-12-31 23:35:00  ...             16.0
525884  2019-12-31 23:40:00  ...             15.0
525885  2019-12-31 23:45:00  ...             14.0
525886  2019-12-31 23:50:00  ...              6.0
525887  2019-12-31 23:55:00  ...              0.0

[525888 rows x 5 columns]

In [ ]:
Parks[3]

                data_e_hora  ...  Navi River
0       2015-01-01 00:00:00  ...         0.0
1       2015-01-01 00:05:00  ...         0.0
2       2015-01-01 00:10:00  ...         0.0
3       2015-01-01 00:15:00  ...         0.0
4       2015-01-01 00:20:00  ...         0.0
...                     ...  ...         ...
525883  2019-12-31 23:35:00  ...         5.0
525884  2019-12-31 23:40:00  ...         5.0
525885  2019-12-31 23:45:00  ...         5.0
525886  2019-12-31 23:50:00  ...         5.0
525887  2019-12-31 23:55:00  ...         0.0

[525888 rows x 6 columns]